{"pages":[{"title":"分类","text":"","link":"/categories/index.html"},{"title":"about","text":"","link":"/about/index.html"},{"title":"标签","text":"","link":"/tags/index.html"}],"posts":[{"title":"","text":"There comes a time in every startup’s life when the leaders and stakeholders have to seriously start thinking about the endgame: What to do when you’ve raised $150 million in VC cash over 15 years en route to building a 100 million-plus community? And how do you go about executing that next step to ensure that you not only survive, but also thrive? This is the predicament that Strava, the social fitness app and community, finds itself in. At a crossroads, of sorts, where it has reached meaningful scale driven by the grit typical of many founder-led businesses, but where it has now hit an impasse to scale further. “What got us here will not be exactly the same as what will get us there,” Michael Horvath, Strava co-founder and then-CEO, said as he announced his imminent departure in February 2023. “I have decided that Strava needs a CEO with the experience and skills to help us make the most of this next chapter.” That next chapter started in January, when Strava announced that its new CEO would be former YouTube executive and Nike digital product lead Michael Martin. Six months into his new role, Martin has already given the first clues as to where his head is at in terms of both business and product, revealing plans to use AI to weed out leaderboard cheats, as well as new features to broaden its demographics. Over the past few weeks, Strava also introduced a new group subscription plan, while it finally gave its users the feature they’ve been asking for more than any other: dark mode, a glaring omission that had frustrated many through the years. For context, YouTube has had dark mode since 2018; X (formerly Twitter) since 2019; and everything from WhatsApp to GitHub has long offered dark mode, too. So what’s the deal, Strava? “If you were to build the Strava app now, or even in the last two or three years, turning on dark mode would have been very straightforward,” Martin explained to TechCrunch. “But Strava is not a new app.” Strava’s dark mode. Image Credits: Strava As the Strava app has evolved over the past 15 years, it has been added to, layered upon, and cobbled in a less-than-congruous fashion that made it difficult to introduce what, to the outside world, would seem like a fairly simple update. “Instead of flipping a switch, it was the exact opposite,” Martin said. “There were hundreds of screens that had to be updated, thousands of UX (user experience) controls, each one of them individually coded. And so it took far more work than people would assume, but I understand why you would think it would be an easy thing.” For dark mode to happen, Strava overhauled the user interfaces to adhere to a more “modern, modular” ethos.”Honestly, dark mode is just a nice benefit of doing all that additional work,” Martin said. “Going forward, every feature will be faster.” While it may have been a hotly anticipated feature, dark mode is the least of Strava’s concerns. It’s a nice-to-have, but it won’t make or break the business. TechCrunch sat down with Strava’s new CEO in London for a wide-ranging interview, delving into what the company is prioritizing and what we can expect in the future as the company embarks on its “next chapter.” “Our product development is finely focused on two things right now,” Martin explained. “‘Building for her,’ which is really just our lens for making sure that we are doing everything to make Strava more inclusive. And the other is AI and machine learning.” “Building for her”Strava doesn’t reveal its gender split, but Martin acknowledged that its user base follows a trend that permeates much of the sporting realm. “Participation rates for women have always substantially lagged men [on Strava],” Martin said. “I think Strava has a unique opportunity to help women be more active and engage in more activities.” There are encouraging signs in some demographics, according to Martin, who pointed to markets like the U.K., France and Spain, which are apparently seeing new user registration rates for women exceed 50% of the whole new user base. In truth, however, this stat could be skewed by the fact that male members are already at a higher saturation point. However, he said that the growth rate of Gen Z female users in the U.K. has doubled in the past six months compared to the previous six months. “So you can start to understand that even if women were less prominent on the platform, that’s starting to shift pretty profoundly, which is what we want to happen,” Martin said. One way Strava hopes to broaden its appeal is through a feature that builds on its existing global heatmaps, which showcase the most well-trafficked running, riding and walking routes. With the soon-to-launch “night heatmaps,” this highlights the busier routes between sundown and sunrise specifically. Night heatmaps in Strava. Image Credits: Strava Additionally, Strava is working on ways to make it easier to conceal specific data points from an activity, which might be useful for those concerned about being monitored. “Quick edit” will enable users to hide certain metrics from their stats, such as their location or activity type. “It’s a mechanism that I learned at Google as a way to find those gaps in the product,” Martin said. “Addressing these gaps ideally will help ‘her’ be more active. And we’re already seeing that in the numbers. This is going to help other people as well; it’s an inclusive design.” The AI factorBesides identifying gaps in the existing product, Martin says he’s looking to borrow from other recent experiences at Google, where he says AI and machine learning were part of just about everything they did. “I’d been working in machine learning and artificial intelligence for almost a decade already, but spending the last couple of years at Google gave me a whole new level of understanding and capability, which I am now employing at Strava,” Martin said. “And you’re going to see more examples of that going forward.” Strava recently announced it would use more sophisticated machine learning to detect “leaderboard cheats.” The Leaderboard is a Strava feature that stirs competition by allowing users to challenge each other over certain “segments” of a route. While most people tackle these segments fairly, accusations frequently abound that some use nefarious methods to beat a particular record, perhaps using a pedal bike on a “run” or an e-bike on an ascent. It’s a major bone of contention in the community, one that led Strava to allow users to manually flag dubious activity, while last year the company updated its algorithms to make “leaderboards more credible.” This included withholding activities that may have been incorrectly labeled (e.g., users tagging a run as a bike ride) or maybe where the GPS data was faulty. Moving forward, Strava will use machine learning to detect questionable activities trained on historical data. But much like dark mode, Martin says that weeding out digital dopers is easier said than done. “As somebody who has been an engineer at many points in my career, I feel like I can imagine an heuristic, an algorithm that can solve for this [leaderboard integrity] relatively easily,” Martin said. “In reality you could, and the team has tried that in the past, but what they have come to realize is that while you can create a heuristic, those heuristics have consistent failings in terms of incorrectly flagging anomalous behavior that isn’t actually anomalous.” This is where Martin hopes machine learning can help: by spotting connections and patterns that a human being creating a “hypothetical heuristic” would never imagine to include in their design. Strava: Leaderboard integrity powered by AI. Image Credits: Strava Details of what this might look like remain somewhat vague, but when pushed on whether Strava might become more effective at detecting someone using an e-bike to ascend a hill, for example, Martin was optimistic but noncommittal. “I think there’s a high probability, but I don’t want to overstate,” Martin said. While Strava already serves up performance data and insights, the company is also turning to AI to make this data easier to parse, particularly for newbies. An upcoming feature called “athlete intelligence” will see Strava deploy generative AI to analyze user data and create summaries and guidance on performance and fitness goals. This will be available to premium subscribers only. “Athlete intelligence is a way of using AI to solve a specific human problem; it can take their data and give them specific contextual information,” Martin said. This might include things like contextualizing a particular segment of a run in terms of how their pace relates to an incline, or explaining how their heart rate over a given period translates into building endurance. Strava’s “athlete intelligence” Image Credits: Strava While Strava isn’t typically bundled alongside traditional social networks like Facebook, the platform is very much used like a social network, with the ability to share photos, videos, comment on activities, and, as of last year, send private messages. The company refers to itself as a “social network specifically for active people.” However, Martin sees things slightly differently. “Strava’s a ‘social product,’” he said. “[But] the point of a social media network is that the whole thing is optimized to maximize your engagement in that network. Strava is optimized and focused on exactly the opposite. Our goal is to motivate you to do something in the real world, not to stay in Strava all the time. The average Strava consumer spends 20 times more in the real world in an activity than they do in the app. And I think that’s a super healthy stat. I’m not looking to change that.” There are other synergies with traditional social networks, too, and not necessarily positive ones. Strava has always been about the data, whether it’s a runner viewing their marathon splits or a cyclist tracking their segment improvements. When pooled, this data could hold immense value for any company wishing to diversify their revenue streams beyond subscriptions. But this is something Strava has been at pains to control the optics around, particularly against the backdrop of Big Tech companies such as Facebook misusing user data. Strava’s main data product is packaged under something called Strava Metro, where it shares aggregate, de-identified data with select city planners, governments and organizations to improve infrastructure. So if Strava data shows that a lot of people are cycling along a particularly busy thoroughfare, it might warrant investment in bike lanes. Strava used to charge for this product, but in 2020 it made the tool available for free, an effort designed to showcase its “good guy” credentials, while also underscoring its main business model as subscriptions. “Strava had already declared that it was not looking to monetize the data of the community,” Martin said. “And so I honor that commitment. One of the reasons I love the subscription business model for a fitness product is it makes it really clear it’s the subscription that’s the product, not your data.” But things get a little murky when you look at Strava’s privacy policy, which is quite clear in how it might leverage user data. While it explicitly says that it won’t sell users’ personal information for “monetary value,” it may “use, sell, license, and share” aggregate information with third parties for “research, business or other purposes” (though users can opt out). In a follow-up question to clarify whether Strava does or doesn’t sell aggregate user data as its privacy policy seemingly permits it to do, the company said that it doesn’t and has no plans to do so, saying: “Strava’s legal notices are designed to address privacy laws, regulations and compliance standards in all its global markets. Given that some regions take an expansive view of terms such as ‘sell’ (and include within the definition activities where no money is exchanged), Strava has opted to mirror that term in order to increase transparency and support differing definitions globally.” The company also said that it intends to update the wording of its policy to reflect the fact that it doesn’t sell any of its data — aggregate or otherwise — for “monetary value.” It is worth noting, however, that Strava also offers a business product where brands can pay to sponsor a particular challenge, with the option to target users by sport type, location and certain demographics. So yeah, the company does use data as part of its targeted advertising efforts. Strava sponsored challenge. Image Credits: Strava The future for StravaWhenever a new leader lands in the hot seat — particularly at a company with such a fervent online community — this can lead to all manner of speculation about why that person was chosen, what skills they have for the job, and more importantly, what direction they’ll take things in. In the case of Strava, why did it hire someone who most recently worked on YouTube’s shopping business? To the casual observer, the synergies were not immediately obvious, sparking some to pontificate that this might signal a new direction for Strava, perhaps with advertising driving revenue. “Just to be direct, I’m not looking to make Strava an advertising product,” Martin confirmed. “YouTube is one of the largest advertising products in the world, and they do a great job of that. But that’s not the right approach for Strava. I believe subscription is the right model for Strava.” So what does Martin hope to bring to Strava from his time at Google’s video-streaming subsidiary? “It’s about building to scale — and YouTube is one of the most scaled products in the world,” Martin said. “It’s about not only understanding what it means to build _to_ that level, but also understanding what it means to build new things within that level.” And then there are other prior experiences, both in a professional and personal capacity, that Martin says meant he was able to hit the ground running in many regards. “I’ve been a member of the Strava community, and a subscriber, for more than seven years — so I’m quite familiar with the product from the consumer side,” he said. “I’ve also worked in the fitness tech space before, I spent time at Nike running competing products. So I understand the area. When you look at my track record, what I’ve done in these different areas of tech is that I’ve either launched new products from zero or I’ve taken products to substantially higher scale.” Most VC-backed technology companies reach some sort of exit within a decade of their foundation, whether that’s an acquisition or IPO. Reddit was an outlier when it went public this year after 19 years, and Strava finds itself in something of a similar position: a veteran of the technology realm, with no obvious exit in sight. But what seems clear from all the product activity over the past six months is that Strava is trying to build something that will reach its full potential one way or another. In support, Martin recently brought on two seasoned veterans in the form of new CTO Rob Terrell from Zynga and Epic Games’ Matt Salazar as chief product officer. “Six months in, my focus right now — I think understandably — is narrow,” Martin said. “The investors are all very much aligned on the board, and the board is very much aligned with the idea that Strava is extremely valuable and that Strava still has opportunity to go after that growth and that value.” But the bulk of the company’s funding came via a $110 million Series F round nearly four years ago, and there isn’t much sense at the moment that the company is in a huge rush to pursue an exit. So should we expect another fundraise anytime soon? “The balance sheet remains strong; we’ve been profitable from an adjusted EBITDA standpoint for more than four years already,” Martin said. “Our entire business top line, all the way down to profitability, has actually become much more successful in the last couple of months. So we don’t have any pressing need to raise capital.”","link":"/2024/07/21/Strava's next chapter： New CEO talks AI_ inclusivity_ and why'dark mode' took so long _ TechCrunch/"},{"title":"The Asus ROG Ally X turns PC gaming into a portable console | TechCrunch","text":"A little more than a year after launching the ROG Ally, Asus is releasing a refined version of its portable device, the ROG Ally X. This Windows-based machine starts shipping on July 22 for $800. I’ve been playing with the portable console for a few days, and there’s already a lot to like — especially on the hardware front. Released in 2022, Valve’s Steam Deck helped mainstream handheld PC gaming. It wasn’t the first company to explore the form factor, but Valve hit on the right combination of specs, portability and price. When it became an instant hit, PC manufacturers took note. Lenovo released the Legion Go and Asus had its own take on handheld PC gaming with the ROG Ally. There are other niche manufacturers, such as Ayaneo, as well. Image Credits: Romain Dillet / TechCrunch The device has a bright seven-inch display with a 1080p resolution and a 120Hz refresh rate. Like on a Nintendo Switch, the display is flanked by your standard array of gaming buttons and joysticks. Unlike on the Switch, the controls aren’t frustratingly small. The ROG Ally X feels like a full-size controller in your hands. The joysticks look and feel like the joysticks on a modern Microsoft Xbox controller. The A/B/X/Y buttons are large and clicky. The analog triggers have plenty of travel, as well. I wasn’t totally sold on the D-pad, however. It feels mushy, a bit like the D-pad you would find on a third-party budget controller. Similarly, the View and Menu buttons are hard to reach. They are right next to the display, requiring me to stretch my thumbs to pause a game. There are two additional macro keys at the back of the device. I configured them as View and Menu buttons, and it helped. On each side of the screen, you’ll also find a command center button to tweak performances on the fly and an Armoury Crate button to display Asus’ game launcher. The ROG Ally X’s main software interface, Armoury Crate SE, is okay at best. It acts as a game launcher, centralizing everything you’ve installed from Steam, the Epic Games Store, Ubisoft Connect, etc. It can also change your device’s settings, from the joystick LEDs to the gamepad profiles. If you spend as little time as possible in it, it gets the job done. But there are bugs (a game I installed using GOG Galaxy mysteriously disappeared from my list), it can be frustratingly slow to open a menu and I had a couple of crashes. The same is true for the command center. It is an indispensable tool to adjust settings on the fly, such as the switching from Silent to Performance or Turbo mode, but it sometimes becomes slow to react to your interactions. Image Credits: Romain Dillet / TechCrunch The device is comfortable to hold — for short sessions, at least. The main issue with these kinds of PC gaming handhelds is that they are heavy. They also get warm, especially when you’re playing a game. Prior to testing the ROG Ally X, I spent hours playing with the Logitech G Cloud, an Android handheld that has been specifically designed for cloud gaming and remote play. It’s an extremely satisfying experience as the G Cloud remains quiet (it’s a fanless device), you don’t have to worry about battery life and it’s easy to hold in your hands. We are still at the very beginning of this massive shift in PC gaming from full-fledge PC towers to nimble-but-capable handhelds. Over time, gaming handhelds will become smaller, lighter and quieter. They’ll look more like an Android-based handheld. For now, however, experiences like the G Cloud remain limited. The ROG Ally X, on the other hand, feels like the culmination of gaming handhelds. When Nintendo released the Game Boy 35 years ago, it felt like you could play NES games on the go. Similarly, the ROG Ally X feels like a good gaming companion for long travel days or daily commutes on the metro. Despite its weight, I’ve had no issue immersing myself in games for several hours at a time. Image Credits: Romain Dillet / TechCrunch An indie game machineWhen it comes to performance, Asus has kept the same APU for the ROG Ally X, the AMD Z1 Extreme. However, RAM has been increased from 16GB to 24GB. This makes a difference in gaming performance as memory is shared between VRAM and system RAM. The handheld comes with a user-replaceable 1TB NVMe storage card (in 2280 format). The battery is twice as large (80Wh) as its predecessor, and the proprietary eGPU port has been replaced with a more standard USB Type-C with USB 4 support. The device works particularly well with games that don’t need a top-of-the-range PC, such as Jusant, Cocoon or Prince of Persia: The Lost Crown. The ROG Ally X can easily render 60 to 120 frames per second for those games in 1080p without using the 30W boost mode. For AAA games, you have to make some compromises. I could get around 45 frames per second with the high graphics preset in Marvel’s: Spider Man by enabling RSR, AMD’s resolution upscaling feature. As for games that were really struggling on previous handhelds, there’s no magic here. For instance, you have to use low settings and aggressive resolution scaling in The Last of Us: Part I to reach 30FPS. If you’re really into strategy games or simulation games, the ROG Ally X might not be the best form factor for those games. At least you can plug it to a monitor and use a mouse and keyboard if that’s the only PC that you have. Image Credits: Romain Dillet / TechCrunch As for battery life, it really depends on the type of games that you play and the power mode that you select. You can play Baba is You in “silent mode” for a long time. But using “boost mode” for The Last of Us is going to impact your battery life significantly. Unfortunately, I haven’t had enough time with the device to perform thorough tests, but I’m sure many reviewers will release benchmarks this week. As a gaming console, the most surprising thing about the ROG Ally X is that it’s a PC that runs Windows — at least on paper. Sure, you can install whatever you want and use it in desktop environment. But Windows without a mouse and keyboard is a frustrating experience. It’s fine if you want to install a game launcher and a few games. But a proper laptop (or even a smartphone) is more convenient for everything else. Similarly, as it’s a PC you can install all games that are available on Windows. But some will run better than others so you have to adjust your expectations. You also can tweak the settings to get more battery life or better looking games. Image Credits: Romain Dillet / TechCrunch The ROG Ally X has a console-like form factor. But don’t expect a polished, console-like experience — this isn’t a Nintendo Switch competitor. In many ways, the ROG Ally X, or at least this handheld form factor, could be considered as an early preview of the future of PC gaming. A future shaped like a console that works like a PC.","link":"/2024/07/23/The Asus ROG Ally X turns PC gaming into a portable console _ TechCrunch/"},{"title":"Bethesda Game Studios employees form a ‘wall-to-wall’ union | TechCrunch","text":"Employees at Bethesda Game Studios — the Microsoft-owned game developer that produces the Elder Scrolls and Fallout franchises — are joining the Communication Workers of America. Quality assurance testers at Bethesda’s parent organization ZeniMax unionized last year, becoming Microsoft’s first official union in the United States. In its announcement, the CWA calls Bethesda’s new union “the first wall-to-wall union at a Microsoft game studio,” because it stretches across development teams and job titles, including artists, engineers, programmers, and designers. The CWA says the union will represent a total of 241 workers who have either signed a union card or indicated that they want to join via an online portal. It also says Microsoft has recognized the union (a voluntary step that avoids an election and precedes the actual contract negotiation). A Microsoft spokesperson told VentureBeat the company supports “employees’ right to choose how they are represented in the workplace” and that it “will engage in good faith negotiations with the CWA.” (TechCrunch has also reached out to Microsoft for comment.) “We are so excited to announce our union at Bethesda Game Studio and join the movement sweeping across the video game industry,” said Mandi Parker, a senior system designer at Bethesda, in a statement. “It is clear that every worker can benefit from bringing democracy into the workplace and securing a protected voice on the job.”","link":"/2024/07/23/Bethesda Game Studios employees form a ‘wall-to-wall’ union _ TechCrunch/"},{"title":"TikTok fast-tracks artist account creation for DistroKid members | TechCrunch","text":"TikTok is partnering with the music distribution service DistroKid to fast-track the creation of artist accounts for members. The ByteDance-owned short video platform introduced an Artist Account feature last year to let musicians showcase their new music along with their music catalog on the platform and behind-the-scenes footage. Typically, it takes up to 30 days for TikTok to process documents when an artist applies for this tag. Now, TikTok is offering DistroKid Members — who are paying a $22.99 annual subscription fee — to get registered as an artist within hours. “It’s now faster than ever for any artist to create their official TikTok Artist Account directly through DistroKid, reducing the process from weeks to just hours,” said Phil Bauer, president of DistroKid, in a statement. “Building on our long history of collaboration, DistroKid members now have unique access to tools and features for promoting their music on TikTok’s leading discovery platform,” he added. Last October, ByteDance partnered with DistroKid to allow independent artists to directly make their songs available on both TikTok Music and video editing app CapCut. While TikTok and DistroKid have been long-term partners, ByteDance also runs a rival music distribution service called SoundOn, which launched in 2022.","link":"/2024/07/23/TikTok fast-tracks artist account creation for DistroKid members _ TechCrunch/"},{"title":"How to Architect Software for a Greener Future - InfoQ","text":"Key Takeaways Carbon-aware actions can help you be greener Machine utilization is vital to carbon efficiency The cloud can be helpful in architecting software for a greener future, but it is not without action from you The software will benefit from carbon efficiency Building green is cheaper, more performant, more secure, and more resilient In this article, I will share tips, tricks, and advice on architecting software for a greener future. I’ve been discussing this topic for several years. Previously, I might have started with some NASA data showing global temperatures, carbon dioxide levels, ocean warming, or methane concentrations to highlight climate issues. However, I’m done discussing the problem—many others speak on climate change eloquently. Instead, this article will focus on solutions. Assuming you’re already aware of the climate change situation, we will move straight to addressing it. Why Operational Efficiency? Operational efficiency architecture connects to green software within the broader context of software development. But is it worth discussing? To answer, we first need to ask: what makes software green? Sustainability is a broad term that involves water and land use, carbon emissions, and building software for green purposes. This article focuses on carbon efficiency, which includes three key aspects: energy efficiency (using the least electricity possible), hardware efficiency (using the least embodied carbon), and carbon awareness (doing more when electricity is clean and less when it’s dirty). These concepts are central to this article. Why should you care about operational efficiency? Isn’t code efficiency enough? Efficient code is excellent, but rewriting software in highly efficient languages like Rust can be time-consuming and may require skills your organization lacks. Platforms and languages should help with code efficiency, but it’s not a silver bullet. What about data center efficiency? While hyperscale data centers are more efficient and cloud providers focus on sustainability, cloud users are responsible for sustainability in the cloud. Like driving an efficient car recklessly, inefficient cloud usage still produces emissions. What about greener grids and renewable energy? While the transition to renewables is happening faster than ever, it’s not fast enough. Software must operate efficiently in a world with variable electricity supply, making future-proofing essential. And greener hardware? Despite advances, green hardware alone doesn’t solve energy problems and cannot meet high-performance requirements. Operational efficiency is worthwhile because it’s within your control. You don’t need to wait for external developments—you can start today. Small efforts can yield significant benefits, often resulting in cheaper, more performant, and more resilient services. I hope this article convinces you of its importance. Carbon AwarenessNext, we need to discuss some terminology essential for understanding the rest of this article. I mentioned carbon efficiency, an umbrella term meaning to use the least amount of carbon possible. Carbon awareness is one aspect of carbon efficiency. Although it sounds a bit sci-fi, carbon awareness means using electricity when and where it is greener. This approach helps decarbonize the grid immediately by using existing green energy and supports renewable energy producers financially over time. Does this work? Moving all workloads in the world to a place like Norway, which relies on hydropower and is green, sounds attractive. But all the workloads in the world are a lot, and this could (would!) overload local data centers. Moving some workloads, however, where it logistically and legally makes sense, is a good idea. Carbon awareness is not a silver bullet and must be used correctly to be effective. When appropriately applied, it’s a powerful tool for short- and long-term benefits without overwhelming specific regions. You can access data on grid greenness through various APIs, which provide real-time information and 24-hour forecasts. These APIs are incredibly useful as you won’t need to learn all the details about your grid—just use the API. Carbon EfficiencyWhen it comes to architecting for carbon efficiency, it boils down to machine utilization. Maximize the use of your physical resources. The goal is to extract as much as possible from your hardware. Why? Firstly, efficiently utilizing one server may eliminate the need to buy another. If one server is inefficiently used, you might need another one to handle the workload. Secondly, there’s a thing called energy proportionality. The switch-on cost of a server is high. Having an idle server incurs a significant baseline cost. As you add more tasks, energy use increases, but not drastically. The baseline isn’t zero; it’s quite high. What Can You Do?What can you do about machine utilization? This article will cover key concepts of being more carbon-aware, more carbon-efficient, and achieving higher machine utilization. I’ll explain some patterns that can make your operations greener. We’ll start with three different carbon-aware actions. Time ShiftFirstly, it’s a time shift, moving to a greener time. You can use burstable or flexible instances to achieve this. It’s essentially a sophisticated scheduling problem, akin to looking at a forecast to determine when the grid will be greenest—or conversely, how to avoid peak dirty periods. There are various methods to facilitate this on the operational side. Naturally, this strategy should apply primarily to non-demanding workloads. For instance, you can’t ask someone to wait seven hours to buy a ticket because solar panels are active on the grid. However, tasks like app updates can afford to wait. Location ShiftAnother carbon-aware action you can take is location shifting—moving your workload to a greener location. This approach isn’t always feasible but works well when network costs are low, and privacy considerations allow. For example, it’s impractical to move a workload across continents, like across Pacific Ocean, due to high network costs and thus high environmental impact. However, shifting to a different region within your country or your cloud provider’s network can benefit workloads with few data dependencies. Consult your cloud provider to identify the greenest region that meets your operational needs. Demand ShapeThe last carbon-aware action is demand shaping, which can seem quite futuristic. This involves altering your software’s behavior to optimize energy usage: doing more when energy is green and less when it’s not. There are two approaches to implementing this: making decisions autonomously without user involvement or offering users an eco or low-carbon mode for optional selection. For instance, you can schedule background updates during off-peak energy times without user intervention, or users can opt into eco modes for reduced energy consumption. This concept may sound futuristic, but it’s already widely adopted in the industry. Companies like Google, Xbox, Windows, and iPhone employ demand shaping for tasks like media processing, game installs, updates, and clean charging. It’s environmentally friendly and can reduce energy costs when electricity demand is lower. Carbon efficientThese are some things that will increase your carbon efficiency by maximizing your machine utilization. Here are three key ones: right-sizing, autoscaling, and mixing workloads. Right-sizingRight-sizing involves fitting your virtual machine or any resource, like containers, to match its usage on a physical server. Instead of optimistically provisioning a large resource and forgetting about it, right-sizing requires thoughtful analysis from the outset. By matching resources to actual needs, you can maximize the use of each physical server, saving energy and reducing embodied carbon over time, thanks to energy proportionality. Right-sizing also influences capacity planning in your data center or the cloud. Overprovisioning signals the need for more hardware purchases, potentially leading to unnecessary resource use. If everyone adopted right-sizing practices, capacity planning could be more sustainable and accurately aligned with actual demand growth. Implementing right-sizing requires careful planning and orchestration beyond simply drawing rectangles and making recommendations. One tool to achieve this is auto-scaling. AutoscalingLet’s discuss autoscaling. Imagine the same chart, now with added demand. Autoscaling dynamically adjusts resources—such as virtual machines or containers—to match demand. Initially, it’s not so complicated to scale up when anticipating increased demand, ensuring sufficient resources. It is a safe move that most of us are happy to make. However, scaling down is equally crucial for sustainability, preventing overprovisioning and inefficient resource use. Autoscaling is particularly effective for workloads with variable demand, like those experiencing peak and off-peak hours. It enhances resource utilization, making it a greener option overall. Cloud providers typically support autoscaling, or you can implement it with a cluster scheduler or infrastructure as code, albeit not without effort. Mixed workloadsNext, I’d like to discuss mixing workloads. Imagine two workloads coexisting on the same system, differentiated perhaps by time or other factors. To achieve maximum utilization, you want the resource use of these workloads to interlock or complement each other over time. For example, customers in different regions, like Southeast Asia and Northern Europe, may have staggered activity times. By scheduling their workloads to overlap less, you can optimize machine usage—using more resources when one workload is less active and vice versa. This strategy requires tagging workloads with attributes for effective scheduling rather than relying on automatic processes. It’s particularly effective for diverse patterns, such as bursty ticket sales versus steady update installs. Another related concept is multi-tenancy, where different customer needs are combined to maximize machine efficiency. While challenging, hyper scalers excel at this approach because it reduces the number of machines needed, thus enhancing energy proportionality and overall efficiency. Sustainability—Cost—ResilienceWe’ve explored several actions and how they enhance sustainability through key strategies. What’s crucial to highlight is that these actions don’t operate in isolation. Sustainability shouldn’t stand alone but should interlock with other critical metrics, such as cost. Increasing machine utilization often reduces costs, making it a dual benefit. You can prioritize cost savings and then consider sustainability benefits, or vice versa. Resiliency is another significant factor. Many green practices, like autoscaling, improve software resilience by adapting to demand variability. Carbon awareness actions also serve to future-proof your software for a post-energy transition world, where considerations like carbon caps and budgets may become commonplace. Establishing mechanisms now prepares your software for future regulatory and environmental challenges. Will Moving to the Cloud Help?I’ve mentioned the cloud several times. Will migrating to the cloud solve all your sustainability problems magically? Not quite. While it can be beneficial, it’s not simply a matter of lift and shift. There are vital considerations to keep in mind. One concept I want to highlight is LightSwitchOps, which Holly Cummins discussed at last year’s QCon. It’s about making it as easy to switch off resources as it is to turn off a light switch. Just as we trust that the lights will switch on when we return to a room, we should trust that idle resources can be efficiently shut down and turned back on again—whether it’s a server or a network connection. Removing idle resources is cost-effective and greener, reducing unnecessary resource consumption and sending accurate signals to capacity planning. Additionally, there’s serverless computing, which is promoted heavily by cloud providers. Serverless allows you to delegate workload management to the provider, optimizing machine utilization safely. It leverages managed services like databases and pre-optimized instances designed by the cloud provider. By using these services as intended, you benefit from their efficiency and cost-effectiveness without replicating the effort internally. Building and maintaining equivalent systems independently would require significant development time, effort, and cost, making it less worthwhile than leveraging cloud provider offerings. What Do Cloud Providers Say?Don’t just take my word for it. What do the cloud providers say about this? Let’s go through the three big ones and their well-architected frameworks to learn together what they think you should do to architect greener software. Google CloudLet’s start with Google Cloud’s approach through their Google Cloud Architect Framework, which mirrors a well-architected framework. It’s built on five pillars: operational excellence, security, privacy and compliance, reliability, cost optimization, and performance optimization. Within this framework, they emphasize sustainability with six actionable strategies for greener practices on Google Cloud. Firstly, understanding your carbon footprint is vital. Google provides tools for location- and market-based scope 2 emissions, though location-based is recommended for clarity and accuracy if you are interested in lower lever insight. On an organizational level, market-based numbers might also be interesting. This tooling helps organizations gauge and manage their environmental impact effectively. Next, choosing the most sustainable cloud regions aligns with the principles of location shifting discussed earlier. Google Cloud offers a list of recommendations based on historical data, aiming to minimize environmental impact through strategic workload placement. Selecting the most suitable cloud services is crucial. Google advocates for services like serverless options such as Cloud Run and Cloud Functions, which maximize resource efficiency through automatic scaling and efficient workload management. Google Kubernetes Engine and BigQuery are also prominent due to their managed and serverless capabilities, which optimize machine utilization. Google also encourages minimizing idle resources. By ensuring that resources are actively utilized rather than left idle, organizations can reduce unnecessary energy consumption and improve workload management efficiency. Lastly, Google Cloud promotes reducing emissions from batch workloads by optimizing scheduling to leverage greener energy sources when available. In summary, Google Cloud’s approach integrates sustainability seamlessly into its architectural recommendations, emphasizing efficient resource usage and environmental stewardship through thoughtful cloud service utilization. AWSAWS, like Google Cloud, emphasizes sustainability as one of the pillars of its well-architected framework, alongside operational excellence, security, reliability, performance efficiency, and cost optimization. This inclusion underscores the importance of integrating environmental considerations into cloud architecture decisions. AWS offers several key recommendations for incorporating sustainability into cloud operations: AWS advises selecting regions with greener energy options to minimize environmental impact. This strategy aligns with choosing cloud regions based on sustainability metrics to reduce the carbon footprint of data center operations. Aligning resource provisioning with actual demand patterns is crucial. This practice ensures that infrastructure is utilized optimally, avoiding underutilization and overprovisioning. It also helps reduce unnecessary energy consumption during periods of low demand. Another focus area is optimizing software and architecture. AWS encourages using managed services, right-sizing instances, and adopting serverless computing models like AWS Lambda to minimize resource waste and improve energy efficiency. Efficient data management is promoted to avoid unnecessary data accumulation. AWS recommends evaluating data needs and retention policies and ensuring that only essential data is stored. This approach reduces storage and processing energy costs. AWS suggests using hardware and instance types that have minimal environmental impact. For instance, AWS Graviton processors are highlighted for their efficiency in specific workloads. Additionally, AWS promotes spot instances for cost-effective batch processing and time-sensitive workloads. Integrating sustainability into organizational culture and processes is also emphasized. AWS acknowledges the importance of embedding environmental stewardship into company values and operational practices, fostering long-term commitment to sustainability. AWS’s approach underscores a comprehensive strategy to integrate sustainability into cloud architecture, focusing on efficiency, cost-effectiveness, and environmental responsibility. Organizations can effectively align their cloud strategies with sustainable practices by leveraging their well-architected framework. AzureLike AWS and Google Cloud, Azure incorporates sustainability as a pillar in its well-architected framework, alongside reliability, cost optimization, operational excellence, performance efficiency, and security. This holistic approach aims to integrate environmental considerations into the design and deployment of workloads on Azure. Azure provides several key recommendations for building greener solutions on their platform: Application design focuses on coding efficiently; we will not cover that now. Application platform considerations emphasize carbon awareness, right-sizing resources, and eliminating idle resources. Azure encourages using managed services and highly optimized platforms like Azure Kubernetes Service (AKS) for efficient resource utilization. Azure includes testing strategies in CI/CD pipelines to ensure sustainable practices during software development and deployment phases, promoting automation and efficiency in testing processes. Operational procedures encompass the measurement of carbon footprint, cultural changes, and operational practices that promote sustainability across organizational workflows and practices. Network and connectivity considerations highlight strategies to minimize data transmission over networks and optimize data flow to and from applications to reduce energy consumption and enhance efficiency. Storage practices discourage data hoarding, emphasizing the importance of storing only necessary data to minimize storage costs and energy consumption. Security recommendations integrate sustainability by designing secure architectures that minimize environmental impact, ensuring that security measures contribute to overall energy efficiency and resource optimization. Azure’s approach underscores a comprehensive strategy to integrate sustainability into cloud architecture, promoting efficient resource utilization, minimizing environmental impact, and aligning with best practices in cloud computing. SummaryWhat should you take away from this article? Carbon-aware actions, like demand shifting and shaping, can help you be greener and future-proof your operations for a post-energy transition grid. Machine utilization is vital to carbon efficiency; you want appropriate machine utilization by removing idle resources and taking actions such as right-sizing and auto-scaling. Cloud can help, but only with your action; think about using managed resources or the most efficient hardware. The software will benefit from carbon efficiency, and building green is cheaper, more performant, more secure, and more resilient. About the Author[![](https://cdn.infoq.com/statics_s1_20240705081916/images/profiles/7621c141141a2fb841e6f3f9f53614a Show moreShow less","link":"/2024/07/23/How to Architect Software for a Greener Future - InfoQ/"},{"title":"8 Free AI Drawing Websites in China, Supporting Midjourney and Other Drawing Models","text":"AI drawing is a technology based on deep learning models, such as Generative Adversarial Networks (GANs), which can analyze thousands of artworks and learn different artistic styles and techniques. Users only need to provide simple descriptions or choose specific styles, and AI drawing tools can automatically generate unique paintings. Today, I will share with you 8 free AI drawing websites in China~ For your convenience, the links in the article have been collected in the AI navigation website: https://ai-to.cn 1. Xinghuo AI Drawing Portal: http://m6z.cn/5VYZ3H Recommendation Index: ⭐⭐⭐⭐⭐ iFLYTEK’s self-developed AI drawing model supports quick image generation in a Q&amp;A format, completely free Question: Draw a cartoon kitten sleeping on a sofa ### 2. Duobang AI Portal: http://u6v.cn/6wTM12 Recommendation Index: ⭐⭐⭐⭐⭐ Supports the most advanced AI drawing models like Midjourney, Niji, and various styles, and can be accessed directly in China without an external network Question: Create an image of a cute anime-style girl with fair skin performing a mid-air basketball dunk. She is wearing a light blue and yellow basketball uniform with the number 12, and matching light blue sneakers. The character’s pose is energetic yet adorable, and she’s going for a stylish slam dunk. The background is an indoor basketball court, illuminated brightly, with a cheerful crowd of spectators to complement the lively sports scene. The entire scene is vibrant and detailed, encapsulating a youthful and cheerful ambiance. ### 3. Doubao Writing Assistant Portal: http://u3v.cn/5yI2iZ Doubao Writing Assistant is a free AI writing software launched by ByteDance, aimed at improving users’ writing efficiency and quality. This tool can help users generate article outlines, provide writing materials, and even directly output complete article content, making it an ideal choice for content creators, students, and marketers. For example: Draw a kitten running on the grass ### 4. Walnut AI Portal: https://smartwritegpt.com/?user_sn=48609991 Recommendation Index: ⭐⭐⭐⭐⭐ Supports AI drawing models like MJ and SD, accessible directly in China Question: Chinese red national style beauty ### 5. Touch AI Recommendation Index: ⭐⭐⭐⭐⭐ Touch AI Drawing is a domestic AI drawing platform aimed at professional users such as illustrators, comic artists, and designers. It provides a range of advanced features including text-to-image, image-to-image, reference-based image generation, AI model training, AI video generation, and text-to-image. ### 6. AI Xiaoju Portal: https://a.ii.cn/?t=eGnvQlaYsevcz11fc7 Recommendation Index: ⭐⭐⭐⭐ AI Xiaoju is a domestic software that can simultaneously replace GPT+Sora+Midjourney, integrating AI writing, AI drawing, and AI music generation into one intelligent software Question: Cute little pandas, Super exaggerated fluffy hair, pink background, three cute panda babies stacked together, fluffy and delicate fur, cartoon style, cute anime style, ultra high definition resolution ar 9:16 s 250 ### 7. Tongyi Wanxiang Portal: https://tongyi.aliyun.com/wanxiang/ Recommendation Index: ⭐⭐⭐⭐ Alibaba’s Tongyi Wanxiang is a multi-modal AI model developed by Alibaba, aiming to improve machines’ understanding of human language and visual information by understanding and generating various data types like images and text. Question: 3D, a cute little car filled with flowers, the flowers are made of clay material, cute, fresh style, studio lighting, front view, octane rendering ### 8. 6pen Portal: https://6pen.art/ Recommendation Index: ⭐⭐⭐⭐ 6pen is a product that uses AI technology to generate paintings from text. By simply describing the content and style of the picture, you can get the painting.","link":"/2024/07/26/8 Free AI Drawing Websites in China, Supporting Midjourney and Other Drawing Models/"},{"title":"A Comprehensive Guide to Common Midjourney Commands (Part 1) - Essential for Beginners","text":"Today, I was completely captivated by a few images I saw on a WeChat public account. These iterating mountains, this floating boat, and the ancient clothing, it’s simply amazing. I’ve never seen anything like this before. Which master artist painted these, and what prompts were used? Upon further inspection, I realized that it’s not about painting but about Chinese studies. Wow, such beautiful images really drew me in. Attractive images can definitely capture more attention. This only strengthened my desire to learn painting. Just starting to learn, let’s begin with the basics, the page introduction, and common basic commands. I. Interface Introduction First, log in to the system and enter the main page. The first part of the left menu bar is some official announcements and rules, such as updates and prohibitions on generating inappropriate or illegal images. The second part is the beginner’s room. Every user is assigned three beginner rooms. You can join any one of them. After joining, you can see everyone generating their own images on the right side of the page, similar to QQ chat rooms in the past. I used QQ in high school, and it was fresh at that time. During evening self-study sessions, I would secretly play on my phone, waiting for the teacher to leave. Although talking was not allowed, we could enter QQ chat rooms and watch others chat, which was very entertaining. This nostalgic feeling reminded me of QQ chat rooms which are no longer available. The third part is the prompt words. Midjourney only supports input in English. You can use Youdao Dictionary for translation. I prefer this tool for its simple interface and small pop-up windows that can hover over other applications, making it convenient for real-time translation. The fourth part is where you input the prompt words. Typing “/imagine” will bring up a prompt box. Enter your English prompt words in this prompt box and press Enter to generate the image. II. Creating a Private Server A drawback of generating images in the chat room is that your images get quickly buried. Since this platform is used by people worldwide, we need to create a private server for our use. Follow the steps: Upload an image, name it, and click Create. The input prompt area also has other functions. A commonly used one is to upload files, such as uploading a local image for modification. After creating the server, it cannot be used immediately. You need to add the Midjourney Bot to generate images. Enter the Midjourney lobby, click on the member list, and select the bot in the middle. Step by step, add to the server. Add it to your server, click Continue, authorize, and verify. I must say, this website has too many verification steps. You have to verify every small operation, such strong self-protection awareness. The bot has been successfully added. **III.","link":"/2024/06/27/A Comprehensive Guide to Common Midjourney Commands (Part 1) - Essential for Beginners/"},{"title":"Tutorial | Simple Instructions for AI Drawing Software Draw Things","text":"(Due to the interface update of DT, the previously prepared screenshots cannot be used, which has delayed some time, please understand) Since I use an iPad, the screenshots below are all from the DT software interface on the iPad. If you are using a MacBook, the interface should be similar. The interface of DT on the iPhone will be different, you can explore it yourself, I will not go into details here. I will only talk about using DT on the iPad. After downloading and installing DT, the first time you enter the program, it should look like this. Pay attention to the menu on the left side. I won’t go into detail about what all these menu options on the left mean. I will explain them as needed. The “Basic” section contains the basic parameters used for AI drawing, and similarly, the “Advanced” section contains advanced parameters (the old version had them together). “All” contains both basic and advanced parameters. In addition, DT will automatically set the display language based on the system language. If you want to switch languages, you can click on the icon shown in the figure below to switch languages. Clicking on the icon in the lower left corner of the red circle will bring up a “Machine Settings” window. Scroll down to find “Language Selection” to switch to the desired language. You need to restart for it to take effect, which means you need to clear the program from memory and then reopen it. In fact, the first thing to do when opening DT for the first time is to download AI drawing models. DT has built-in links to a large number of models, which can be downloaded directly without the need for a VPN. Which model should you download from so many options? My suggestion is to start with this one, I will use this model to introduce the basic usage of DT. Later, I will talk about the characteristics of different models I have used in more detail. Download this model called Realistic Vision v3.0(8 bit), which is also a well-known model. The other models in the list are ones I downloaded and imported myself, so you don’t need to pay attention to them for now. The green box in the picture controls whether to display the list or large icons. Speaking of models, let me tell you what I know about them. Stable Diffusion, the mainstream model used to be SD1.5 version, now it is SDXL 1.0 version. There are many models trained based on these two versions. Compared to the SD1.5 version, the SDXL 1.0 version has a stronger understanding of semantics and better image quality, and it does not require a lot of image quality content in the prompts. However, SDXL has higher hardware requirements and longer image generation time. I recommend downloading this model trained based on the SD1.5 version, which is completely sufficient for explaining the use of DT. In addition, this model is 8-bit. I don’t understand the specific technical details, but of course, the 16-bit model will have better image quality. However, the 16-bit model is larger in size and takes longer to generate images. The improvement in image quality is almost imperceptible to the naked eye (the author of DT has compared the images), so 8-bit is also sufficient. After downloading the model, you can start drawing. These two boxes, the left one is the positive prompt input box, where you write what you want AI to generate, and the right one is the negative prompt, where you write what you don’t want AI to generate. The meaning of the positive prompt I wrote is a woman, sports top, yoga pants, realistic photo, high definition, 8K, high resolution, detailed face, full body shot, looking at the camera. The negative prompt is to specify not to generate low-quality images, not to generate bad hands or fingers, and to avoid deformities (although even with this description, the probability of generating deformed hands is still high). For convenience, let’s click on “All” in the left column menu so that all parameters are in the list on the right. Pay attention to the settings of the following related parameters. The model is the one we just downloaded. “LoRA” is disabled, “Control” is disabled, these two functions will be explained later. “Strength” is a key parameter, and when generating images, “Strength” is set to 100%. Scroll down the parameter list, set “Image Size” to 512x768. If the image size is too small, the quality of the generated image will also be poor. Speaking of image size, let me say a few more words. The SD1.5 version of the model natively supports a size of 512x512, and the SDXL version natively supports a size of 1024x1024. My experience is that setting a too large size may not necessarily improve the image quality, and it may even result in more deformities in the generated image. That’s why each model’s trainer gives a recommended image size. We are using the SD1.5 version of the model here, and we want to generate full-body shots, so a vertical rectangle size of 512x768 is more suitable. If you really need a large image size, you mainly need to use the “Amplifier” function, which will be explained later. Next, another important parameter is “Steps”. Because I am using an iPad pro, which cannot be compared with a computer equipped with Nvidia 4090, I usually set “Steps” to 20, which I feel is sufficient. The higher the number of steps, the more delicate the generated image, and the more details it will have, but the time it takes to generate the image will also increase exponentially. Continue scrolling down the parameter list, set “Text Guidance” to 7. For the models I often use, the recommended “Text Guidance” value is 10. Setting it to 7 here is fine. (Note: I will talk about whatever comes to my mind. The DT interface has text explanations for these parameters. The gray text below each parameter is the explanation of the parameter. Everyone should read it carefully.) Set the “Sampler” as shown in the figure. There are very professional articles about “Sampler” on Zhihu, you can search and read them. Honestly, I read them and didn’t understand much (^_^;) Set “Clip Skip” to 2. Please refer to the gray text explanation below the parameter for the specific meaning. In my experience, in most cases, it is set to 2, and in a few cases, it can be set to 1. Next is “High-Resolution Repair”, which can be enabled. There is a “Face Repair” above this parameter, let’s disable it for now. I haven’t used this feature, and many model trainers also strongly recommend disabling it. I will talk about better face repair methods later. The other parameters that haven’t been mentioned can be left at their default values. Then you can click the “Generate” button to generate the image. As shown in the above figure, the main window displaying the image will have a blue progress bar, and a small preview image will be displayed in the lower left corner of the window. Once the generation is complete, the generated image will be displayed in this main window. Take a close look at the face, it is not very clear. If you generate a portrait where the face occupies a large proportion of the image, usually the facial details will be rich and not blurry or deformed, so there is basically no need for face repair. But in this case, a full-body shot is generated, and the face occupies a small proportion of the image, so in this situation, the face may be blurry or even the features may be deformed, so face repair is needed. This is a good opportunity to explain how to perform face repair. You can use the pinch gesture to zoom in on the generated image, and you can see that the face is indeed blurry and the details are not good, and the nose and mouth seem to be deformed. Click on the eraser icon at the bottom left of the image window, and use the erasing function in freehand mode to erase the face in the image, I also erased the ears. Next is a crucial step, adjust the “Strength” to 40%, and the erased part of the face on the right side also becomes semi-transparent. In fact, this strength value can be adjusted to 10% to 80%, and the smaller the value, the closer the generated face will be to the original one. When repairing the face, you can try different values to find the most satisfactory result. Then click the generate button. Then AI starts generating, pay attention to the text marked in the red circle, it says “Image Synthesis + Repair”. It’s done, take a look at the face, is the detail richer, not blurry, and no deformation. Click the eraser icon again to exit the erasing mode, so you can pinch to zoom in and out of the image again. The icon circled in red at the top of the interface can save the generated image to the device’s album. The red box on the right side retains all the generated images or operations, and clicking on it can jump to any previous step. Finally, let’s take a look at the generated image. It may not be a great picture (^_^;), personally, I think it is due to the model used and the prompts are actually too simple, without any description of the scene, lighting, style, etc., and without checking the prompt format recommended by the model trainer. This model theoretically can generate more exquisite images. Here, I mainly demonstrated the basic operations of drawing with DT. As for how to generate more exquisite images, it will be discussed later. I generated an image using my commonly used model (trained based on SDXL), under the same prompts, and without any face repair, the result is much better. That’s it for this article, a bit regretful, obviously it is a good model, although it is SD1.5 version. So I made a slight modification to the prompts, added “bright soft light, in gym”, and then tried it, and the generated image did improve a lot, and there was no need to do face repair. The red line is the added prompt. This shows that besides the model, the prompts also have a significant impact on the quality of the final generated image. I generated a few new images and posted them. That’s it for now, next time I will talk about the basic operations of generating images and doodling. See you next time. (˶‾᷄ ⁻̫ ‾᷅˵)","link":"/2024/07/27/Simple Instructions for AI Drawing Software Draw Things/"},{"title":"ChatGPT Tutorial","text":"ChatGPT has been with us for over a year, yet its popularity remains high. If you haven’t had a chance to interact with AI, you might think it’s very difficult to learn how to use it. Everyone says that AI is powerful and can greatly change our lives and work, but in reality, getting started is not as hard as you might think. The key is finding the right way to begin. This article will help you understand the basics of using ChatGPT, including the registration process, prompt writing, and more. How to Register for ChatGPT for Free Visit the ChatGPT official website (https://chat.openai.com) and click the “Sign up” button. You can choose to register with an email address; using a Google email is recommended. You can also choose to log in directly through Google, Microsoft, or Apple accounts. If you register with an email, the system will prompt you to set a password, which must be at least 12 characters long. After completing the registration, you will receive an email with a link to verify your email address. Afterward, the system might ask for additional information, such as your full name and date of birth. Once these steps are completed, you will have successfully registered! For a more detailed registration tutorial, please see: Detailed ChatGPT Registration Tutorial 2024: A Comprehensive Step-by-Step Guide! Log in to ChatGPT, and at the bottom of the main interface, you will find an input box where you can start conversing with the AI. So, what should we do after registering for ChatGPT? Here are some usage tips… How to Use ChatGPT When you start using ChatGPT or other AI platforms, you will often come across the term “prompt.” A prompt is essentially a command you give the AI, telling it what you want it to help you with. For example, “write a script to process data,” and it will immediately generate a script for you. However, if you use a more specific prompt, such as “write a detailed document explaining a new feature: write a Python script to read data from a CSV file, filter out rows with missing values, and output the results to a new CSV file, ensuring the script can handle more than 10,000 rows of data and run on both Windows and Linux systems,” you will get content that better meets your needs. You can write your own prompts as needed or use prompts written by others. When writing your own prompts, it is crucial to be clear about what you want ChatGPT to accomplish. Using directive verbs such as “write,” “explain,” “create,” etc., can make your commands more precise. The clearer your instructions, the more likely you are to get results that meet your expectations. Additionally, providing enough context information is key. As mentioned earlier, a vague instruction might yield a script, but it might not meet your specific needs. Make sure you specify what you want ChatGPT to include (or exclude). For example, if you don’t want your script to include date data, make sure to state that clearly. When interacting with ChatGPT, expressing your true feelings or problems can help you get better answers. For example, saying “this issue is really important for my work” or “I really need an accurate answer this time” can help ChatGPT better understand your needs and provide more satisfactory answers. If you get an answer from ChatGPT that you like but it’s not perfect, you don’t need to start over. Simply tell the AI what went wrong, and it will try again, considering your corrections. Something like “Can you rewrite the above content, but this time only use 12 lines instead of 16?” Providing ChatGPT with more information about yourself can also help you get more targeted answers. Note: Do not provide personal privacy information, such as when using it to help write an email. Telling ChatGPT you are a project manager can help it provide more focused and accurate responses. In fact, you can provide ChatGPT with some detailed information about yourself in advance, so it can make personalized adjustments when answering your questions each time. To do this, visit the “Customize ChatGPT” option by clicking on the personal information icon in the bottom left corner of the page. Here, you can add information about yourself and customize how you want the platform to respond. For example, if you are a student, you can fill in “I am a diligent college student majoring in English” in the first box of the customization description and add “Always reply in a formal academic writing style and provide detailed explanations, avoiding unnecessary wording” in the second box. How to Manage How ChatGPT Uses Your Data ChatGPT reminds users not to share too much personal information. This is good advice for using any AI tool, but especially important when using ChatGPT. You should never share personal data, sensitive company information, or password information with ChatGPT. This year, OpenAI introduced a memory feature for ChatGPT, which is not yet available to all users. As the name suggests, this feature allows the tool to remember information about you for future use. If you are uncomfortable with this, you can choose to turn it off. Go to “Settings” &gt; “Personalization” &gt; “Manage Memory,” where you can view and delete specific memories or clear all memory. Just like your web browser, ChatGPT remembers everything you previously entered. But you can also manage this information. Under “Settings” &gt; “General,” you can view all previous chat records and delete them individually. You can also use a red button to delete all records at once. Is It Worth Upgrading to ChatGPT Plus If you are just starting to use ChatGPT, the free version should be sufficient. However, if you are already proficient in using ChatGPT, then a subscription service might be more suitable for you. The Plus subscription costs $20 per month. With the upgrade, you can use the more powerful ChatGPT model GPT-4, as well as continue to use the standard GPT-3.5. GPT-4 is more powerful but has a longer response time and a limit of 50 uses per 3 hours, which might not be ideal for frequent users. Plus subscribers can also create images directly within the ChatGPT environment using DALL-E 3. Perhaps the appeal of ChatGPT Plus is the ability to use custom GPTs. With Plus, you can access the ChatGPT Store and hundreds of GPTs created for specific tasks. How to Use the ChatGPT GPT Store The ChatGPT Store is a relatively new feature for ChatGPT Plus users, offering many practical GPTs to enhance your experience with ChatGPT. If you find using prompts difficult or want to make the most of ChatGPT’s capabilities but don’t know how, visiting this store could be very helpful. For example, Logo Creator allows you to generate logos directly from ChatGPT in seconds. GPT Consensus is one of the popular GPTs, capable of searching over 200 million academic papers and providing relatively accurate references. Using GPTs from the ChatGPT Store is as simple as clicking on the app you like and starting to use it. You can also use the search function to narrow down what you’re looking for and check the star ratings—some GPTs are clearly better than others, and higher ratings can help you find GPTs truly worth your time. Depending on your level of use with ChatGPT, you can even create and sell your own GPTs on the platform. Note: The article is from “Sitou Wencheng” author AI Decoding Master. The copyright belongs to the original author and original source. The content represents the author’s views and does not necessarily reflect the views of this public account or guarantee its authenticity. The reprint is for non-commercial purposes, aimed at sharing, and if it involves copyright issues, please contact us immediately. We will amend or delete the related article to ensure your rights.","link":"/2024/06/21/ChatGPT Tutorial/"},{"title":"Guide for Beginners on Using ChatGPT for Literature Reviews","text":"Today, Ajiu will discuss how to utilize ChatGPT, this powerful tool for literature reviews, enabling beginners to quickly grasp the essence of literature reviews. Regarding how to use ChatGPT for literature reviews, I have summarized a 4+1 model, which consists of 4 core steps and 1 important tip. This model has been repeatedly verified after guiding dozens of graduate students to complete literature reviews. When you share with your classmates or friends, you can use this 4+1 model, which is simple, easy to remember, practical, and efficient. What are the four core steps? First: Collect and organize relevant literature. Second: Extract key information from each paper. Third: Use ChatGPT to summarize themes and generate the first draft. Fourth: Manually review and refine the review content. Why should you first collect and organize relevant literature? There are two reasons: Firstly, this ensures that you grasp the full scope of the research field; secondly, having a sufficient literature foundation allows ChatGPT to better understand and synthesize information. Many people don’t understand this and always want the AI to directly generate the review. This approach may not only miss important literature but also lead to a partial or incorrect review. The key to a literature review is to comprehensively understand the current state of research, not to expect the AI to create something out of nothing. After collecting the literature, we need to extract the key information from each paper. Specifically, this means summarizing the research questions, methods, results, and conclusions of each paper. This step can be made more efficient with the help of ChatGPT. How to efficiently extract literature information? I have summarized a 3-step rule. Step one: Input the paper abstracts into ChatGPT and ask it to extract the key information. Step two: Read ChatGPT’s summary and check its accuracy against the original text. Step three: If necessary, ask ChatGPT to further explain or supplement specific content. At this point, Ajiu can’t help but think of a master’s student’s experience. She initially felt confused about how to extract key information while doing a literature review. Later, by following this method, she completed the information extraction of 30 core papers in less than a week, greatly improving efficiency. So, why use ChatGPT to summarize themes and generate the first draft? Ajiu’s PhD student, Xiao Li, discovered during his first attempt that ChatGPT not only quickly identified common themes in the literature but also generated a clearly structured first draft. This saved him a lot of time in organizing and writing, allowing him to focus more on in-depth analysis and critical thinking. In fact, AI has unique advantages in summarizing and organizing information. It can quickly process large amounts of information, identify key themes and research trends, providing us with a valuable starting point. Remember, if the first draft generated is not ideal, don’t be discouraged. Input your specific requirements and additional information again, and you often get results that better meet your expectations. The last core step is manually reviewing and refining the review content. Why is this step so important? Because although ChatGPT can generate a good first draft, it may miss some details or misunderstand certain professional concepts. Manual review ensures the accuracy and depth of the review. For example, a student previously found that ChatGPT missed an emerging research direction during the review. By adding this part, his review became more comprehensive and cutting-edge. Finally, let’s talk about that important tip: maintain critical thinking. When using ChatGPT for literature reviews, we must always keep independent thinking. AI can help us organize information, but evaluating literature, identifying research gaps, and proposing new insights all require your professional skills and innovative thinking.","link":"/2024/07/28/Guide for Beginners on Using ChatGPT for Literature Reviews/"},{"title":"ChatGPT for Paper Writing, the Ultimate Practical Guide","text":"Today’s topic is: The application of ChatGPT in polishing academic papers (summary of practical tips + beginner-friendly)! Before we start, let’s address a question that many students have asked: ChatGPT seems to be losing its hype now, is it still worth paying attention to? My answer is yes. Why? We know that a trend like ChatGPT cannot remain a hot topic forever; it will gradually cool down over time. However, as the hype fades, the practical value of ChatGPT continues to rise due to significant investments in human and financial resources. Although ChatGPT’s popularity is waning, its capabilities are continually updating and maturing, making it more beneficial for academic applications (especially in paper writing). The theme of this video is ChatGPT and academic papers. Why create this content? Currently, online content about ChatGPT and paper writing is vast and varied, with mixed quality. Some just ride the wave, posting short videos that don’t clearly explain practical usage; others make eye-catching claims like completing a thesis or literature review in one day with ChatGPT. This flood of information is unfriendly to those who don’t truly understand ChatGPT but want to use it to improve their paper writing. Without proper guidance and discernment, many students might blindly imitate and misuse ChatGPT, ultimately failing to enhance their writing and even lowering the quality of their papers! Therefore, the main purpose of this video is to provide a more experienced perspective, to sift through the information, and to tell you which use cases or angles are genuinely valuable if you want to use ChatGPT to enhance your paper writing. First, let’s clarify two points about using ChatGPT. Since many who came into contact with ChatGPT late still don’t understand how to use ChatGPT and NewBing chat, I frequently receive private messages with similar questions about how to download ChatGPT and how to use it. It’s hard to respond to everyone individually, so here is a unified explanation as shown in the image below. Next, let’s outline the different forms of using ChatGPT, their characteristics, and how to choose the correct form in practical use (as shown in the image below); Once you are familiar with each form of ChatGPT usage and its characteristics, we can look at its specific applications in paper writing. Here, I have summarized six practical scenarios where ChatGPT can be effectively applied. Next, let me show you specific commands and steps for these scenarios:","link":"/2023/08/27/ChatGPT for Paper Writing, the Ultimate Practical Guide/"},{"title":"ChatGPT Practical Guide (Part 1) Writing Articles","text":"ChatGPT Practical Guide (Part 1): Writing Articles (Blogs, 10,000-word Papers, etc.) With the advent of the AI era, I will share some practical guides on using ChatGPT for content creation and productivity. Goal: Use ChatGPT to write an article of about 10,000 words (on the evolution of ChatGPT) Steps for Creation: Write an outline; Write the detailed content based on the outline; Create an engaging title (viral title);Note: You can contact the editor to register an account for free.Special Note: Using English will be faster and more accurate; you can ask for a translation into Chinese afterward. 1. Writing an OutlineDifferent ways of asking will yield different results. Learning to ask questions effectively will improve the outcome. For example:1.1 To briefly discuss the evolution of ChatGPT, you can ask:Can you provide an outline about “the evolution of ChatGPT” 1.2 For a long-form article or paper, you can ask: write an outline of “the evolution of ChatGPT” for a blog** 1.3 For a university thesis outline (more detailed), you can ask:write an outline of “The ChatGPT Revolution: How AI Has Evolved” for a university thesis 2. Writing the Detailed Content Based on the OutlineQuestion: Can you provide an outline about “the evolution of ChatGPT” 2.1 Writing the first point After receiving the outline, ask:please write more about 1. 2.2 Writing the second point in an “expert” tone please write detail on 2. as an AI expert 2.3 Specify the word count for the third point write 3. as an essay, 500 words 3. Creating a Titlegive me 5 viral name options for “the evolution of ChatGPT” And just like that, an article about ChatGPT is born. The AI’s content generation and translation abilities are impressive!","link":"/2023/02/24/ChatGPT Practical Guide (Part 1) Writing Articles/"},{"title":"ChatGPT Practical Guide (Part 2) Short Video Production","text":"ChatGPT Practical Guide (Part 2): Short Video Production (Helping you quickly dominate Bilibili, TikTok, and WeChat Channels, haha) Goal: Create a 3-minute short video (become a video content creator dominating Bilibili, TikTok, and WeChat Channels) Resources: 1. Free images and videos: www.pexels.com2. Video creation tool: https://www.veed.io/ Steps for Creation: Use ChatGPT to write the video script Use the AI tool Veed.io to create the video 1. Use ChatGPT to Write the Video ScriptKey words: video, scripts I want to create a 1-minute video about “what is the future of ChatGPT and how it can change our life,” can you create scripts for the video? 2. Use the AI Tool Veed.io to Create the VideoWebsite: https://www.veed.io/Veed is a free-to-start video creation tool. 2.1 Convert text to speechTranslate the script into Chinese, click “Text To Speech,” and generate a 1-minute female voiceover. 2.2 Add background musicUse the built-in BGM (background music) of the video tool and insert it (lower the volume a bit). 2.3 Create a titleAdd a cover and create a title, “The Future of ChatGPT?” 2.4 Add copyright-free images and videosFree website (no registration needed): www.pexels.comDownload and add the images and videos. 2.5 Export the video Video PreviewVideo Details Try creating your own video now, and you could be the next viral content creator!","link":"/2023/02/25/ChatGPT Practical Guide (Part 2) Short Video Production/"},{"title":"ChatGPT Practical Guide (Part 3) Mastering Prompts (Hundreds of Roles to Choose From - Teacher, Drunkard, etc.)","text":"ChatGPT Practical Guide (Part 3): Mastering Prompts (Hundreds of Roles to Choose From - Teacher, Drunkard, etc.) ChatGPT can answer a wide range of questions, but many users have concerns about the accuracy and professionalism of the answers.In fact, if you want ChatGPT’s answers to be more professional and accurate, you need to use more specialized prompts. Example Demo: Standard Version: Expert Version: As you can see, different prompts lead to different responses from ChatGPT. Therefore, learning how to ask questions to quickly get the results you want is essential. Here is a recommended GitHub open-source project that can help you ask questions in different roles to get the answers you need. Recommended LinkGitHub: Awesome ChatGPT Prompts Star: 32.4khttps://github.com/f/awesome-chatgpt-prompts With hundreds of roles to choose from, I hope you find these prompts useful and enjoy using ChatGPT! https://github.com/f/awesome-chatgpt-prompts","link":"/2023/02/26/ChatGPT Practical Guide (Part 3) Mastering Prompts (Hundreds of Roles to Choose From - Teacher, Drunkard, etc.)/"},{"title":"ChatGPT Practical Guide (Part 4) Summarizing 50 Future Use Cases","text":"ChatGPT Practical Guide (Part 4): Summarizing 50 Future Use Cases 1 Content Creation: You can generate high-quality articles, blog posts, product descriptions, or other written content for clients using ChatGPT. The model’s text generation capabilities can help you create engaging and informative content in a fraction of the time it would take to write manually. 2 Customer Service Chatbots: ChatGPT can be used to create conversational AI for customer service or sales applications. The model can be trained to respond to customer inquiries and help provide product recommendations, freeing up human representatives to focus on more complex issues. 3 Lead Generation Chatbots: You can create a chatbot that automatically generates leads for businesses by asking potential customers questions and collecting information. The chatbot can be integrated into business websites or social media channels. 4 Virtual Writing Assistant: You can use ChatGPT to provide virtual writing assistant services, where the model can assist with writing tasks such as proofreading, editing, and generating ideas for content. 5 Personalized Recommendation Systems: ChatGPT can be used to create personalized recommendation systems for e-commerce websites or other businesses. The model can analyze customer data and make product recommendations based on their interests and purchase history. 6 Virtual HR Assistant: You can use ChatGPT to provide virtual HR assistant services, where the model can assist with tasks such as scheduling interviews, answering employee questions, and tracking employee information. 7 AI Writing Assistant for Students: You can use ChatGPT to provide writing assistant services for students. The model can assist with tasks such as proofreading, editing, and generating ideas for academic papers and essays. 8 AI-Powered Language Tutor: You can use ChatGPT to create an AI-powered language tutor service. The model can help with language learning by providing conversational practice and grammar lessons. 9 AI-Powered Financial Advisor: ChatGPT can be used to create an AI-powered financial advisor service, where the model can assist with tasks such as creating investment portfolios, analyzing market trends, and providing financial advice. 10 Virtual Personal Shopping Assistant: You can use ChatGPT to create a virtual personal shopping assistant that helps customers find and purchase products. The model can provide product recommendations and assist with the checkout process. 11 Virtual Legal Assistant: You can use ChatGPT to provide virtual legal assistant services, where the model can assist with tasks such as generating legal documents, answering legal questions, and providing legal advice. 12 AI-Powered Event Planning Assistant: You can use ChatGPT to create an AI-powered event planning assistant that can assist with tasks such as finding venues, creating event itineraries, and managing guest lists. 13 Virtual Real Estate Assistant: You can use ChatGPT to provide virtual real estate assistant services, where the model can assist with tasks such as finding properties, negotiating deals, and managing property listings. 14 AI-Powered Mental Health Assistant: You can use ChatGPT to create an AI-powered mental health assistant that can assist with tasks such as providing therapy, counseling, and support. 15 Virtual Personal Concierge: You can use ChatGPT to create a virtual personal concierge service that can assist with tasks such as making reservations, planning travel, and running errands. 16 AI-Powered Bookkeeping Assistant: You can use ChatGPT to provide AI-powered bookkeeping assistant services, where the model can assist with tasks such as tracking expenses, generating financial reports, and managing accounts payable and receivable. 17 Virtual Interview Coach: You can use ChatGPT to create a virtual interview coach that helps job seekers prepare for interviews and practice their responses to common interview questions. 18 AI-Powered Personal Shopping List: You can use ChatGPT to provide an AI-powered personal shopping list service, where the model can assist with creating shopping lists, finding deals, and tracking inventory. 19 Virtual Personal Stylist: You can use ChatGPT to create a virtual personal stylist service that can assist with tasks such as creating outfit ideas, finding clothing items, and providing fashion advice. 20 AI-Powered Content Creation: You can use ChatGPT to create original, high-quality content for clients, such as blog posts, articles, and social media posts. 21 Virtual Research Assistant: You can use ChatGPT to provide virtual research assistant services, where the model can assist with tasks such as finding information, conducting research, and analyzing data. 22 AI Transcription: You can use ChatGPT to transcribe audio and video files for clients, such as interviews, podcasts, and lectures. 23 Virtual Data Entry: You can use ChatGPT to provide virtual data entry services, where the model can assist with tasks such as entering information into databases, managing spreadsheets, and organizing data. 24 AI Proofreading: You can use ChatGPT to proofread and edit documents for clients, such as academic papers, business reports, and marketing materials. 25 Language Translation: You can provide language translation services for websites or documents. ChatGPT can assist in translating text into various languages, making it a valuable tool for businesses looking to expand their global reach. Other Content generation for websites and blogs Generating product descriptions for e-commerce sites Transcription of audio and video content Language translation services Generating scripts for videos and podcasts Creating chatbot responses for businesses Writing and editing email marketing campaigns Generating social media posts and captions Writing and editing white papers and case studies Content creation for online courses Generating resumes and cover letters Generating legal documents and contracts Creating and editing product manuals and instructions Writing and editing press releases and news articles Generating product reviews and ratings Creating and editing CVs and resumes Generating marketing copy and ad copy Writing and editing website landing pages Generating content for SEO and SEM campaigns Creating and editing product catalogs and brochures Writing and editing books and e-books Generating content for video games Writing and editing mobile apps Creating and editing scripts for advertisements and commercials Writing and editing company newsletters and internal communications Generating content for virtual reality and augmented reality experiences Writing and editing for virtual event platforms Creating and editing scripts for webinars and live streams Generating content for podcast episodes Writing and editing infographics and data visualizations Creating and editing scripts for animations and motion graphics Writing and editing for virtual tours and VR experiences Generating content for virtual and augmented reality games Writing and editing for virtual assistants and voice assistants Creating and editing scripts for podcast and radio dramas Generating content for virtual reality and augmented reality training programs Writing and editing for VR and AR marketing campaigns Creating and editing scripts for VR and AR presentations Generating content for VR and AR trade shows Writing and editing for VR and AR customer service applications Creating and editing scripts for VR and AR employee training programs Generating content for VR and AR educational projects Writing and editing for virtual and augmented reality tourism and travel applications Creating and editing scripts for virtual and augmented reality art and entertainment experiences Generating content for VR and AR healthcare and therapy applications Writing and editing for VR and AR industrial and manufacturing applications Creating and editing scripts for virtual and augmented reality real estate and architecture applications Generating content for VR and AR legal and financial applications Writing and editing for VR and AR scientific and research applications Creating and editing scripts for VR and AR government and public sector applications","link":"/2023/03/03/ChatGPT Practical Guide (Part 4) Summarizing 50 Future Use Cases/"}],"tags":[{"name":"AI","slug":"AI","link":"/tags/AI/"},{"name":"Midjourney","slug":"Midjourney","link":"/tags/Midjourney/"},{"name":"Draw Thing","slug":"Draw-Thing","link":"/tags/Draw-Thing/"},{"name":"ChatGPT","slug":"ChatGPT","link":"/tags/ChatGPT/"}],"categories":[]}